In [3]:
# import libraries
import pandas as pd
import numpy as np

In [4]:
# read the csv file
df = pd.read_csv("train.csv")

In [5]:
# let us view that dataframe
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# let us view first 5 rows # dataframe.head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# last 5 rows
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
# check the type 
type(df)

pandas.core.frame.DataFrame

# Series

In [10]:
# selecting only one column from above dataframe datafram[colname]
series1= df['PassengerId']
series1

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [11]:
# check the type
type(series1)

pandas.core.series.Series

In [12]:
# let us create our own series
'''
pd.Series(iterable object)
'''

series2 = pd.Series([1,2,3,4,5])
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
# let us assign the name to above series
ary1 =  np.arange(1,10)
series3 = pd.Series(ary1, name="Test1")
series3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Test1, dtype: int32

In [19]:
# create another series and change the datatye
series4 = pd.Series([1,2,3,4,5], dtype = float)
series4

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [20]:
# extract the index of the series
series4.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
# rename the index of series
series5 = pd.Series([5,6,7,8,9], index =['a','b','c','d','e'])
series5

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [22]:
# extract the index for series 5
series5.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [23]:
# let us again create a series with different number of elements and indexes
pd.Series([5,6,7,8,9], index =['a','b','c','d']) #an error occured because the ele size is not matching with index size

ValueError: Length of passed values is 5, index implies 4.

In [25]:
# series are generally homogeneous data type, but you can also create heterogeneous series
list1 = ['Parmeet',1, 2.0]
series6 = pd.Series(list1)
series6

0    Parmeet
1          1
2        2.0
dtype: object

In [30]:
# let us create another series with all elements as string
list2 = ['Parmeet', 'Trishaan','Anit']
series7 = pd.Series(list2)
series7

0     Parmeet
1    Trishaan
2        Anit
dtype: object

In [31]:
# indexing in series
series3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Test1, dtype: int32

In [34]:
series3[4] # extracting thee 5th element form above series

5

In [35]:
series3[1:5] # series(startindex=0, stopindex =-1, step =1)

1    2
2    3
3    4
4    5
Name: Test1, dtype: int32

In [41]:
#print the series in reverse order
series3[::-1]

8    9
7    8
6    7
5    6
4    5
3    4
2    3
1    2
0    1
Name: Test1, dtype: int32

# funtions in series

In [45]:
# arithmetic operations
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
series2.add(2) # adding all elements with 2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [47]:
series2.mul(2) # multiply by 2

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [49]:
series2.div(2) # divide by 2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

In [50]:
series2.mod(2) # getting remainder

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [51]:
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [56]:
series8 = pd.Series([5,6,7,8,9])
series8

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [57]:
# adding two series
series2.add(series8)

0     6
1     8
2    10
3    12
4    14
dtype: int64

In [58]:
# subtract
series2.subtract(series8)

0   -4
1   -4
2   -4
3   -4
4   -4
dtype: int64

In [59]:
# creating another series with 3 elements
series9 =pd.Series([1,2,3])
series9

0    1
1    2
2    3
dtype: int64

In [60]:
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [61]:
# adding series with different number of elements # 4 + NAN = NAN and 5+NAN =NAN
series2.add(series9)

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [63]:
type(np.nan)

float

In [65]:
series_nan = pd.Series([1,2,3,4,np.nan])
series_nan

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [66]:
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [67]:
series5

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [68]:
#adding above two series
series2.add(series5)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [72]:
# fill the mising values
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [73]:
series9

0    1
1    2
2    3
dtype: int64

In [74]:
series2.add(series9)

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [75]:
# fill the missing values with 0
series2.add(series9, fill_value=0) # 4+NAN -> 4+0 = 4

0    2.0
1    4.0
2    6.0
3    4.0
4    5.0
dtype: float64

In [76]:
# let us sort the series
series10 = pd.Series([40,6,34,8,21,9])
series10

0    40
1     6
2    34
3     8
4    21
5     9
dtype: int64

In [78]:
#sorting the series on basis of values
series11 = series10.sort_values() #ascending order
series11

1     6
3     8
5     9
4    21
2    34
0    40
dtype: int64

In [80]:
# sort on basis of index
series11.sort_index() #ascending order

0    40
1     6
2    34
3     8
4    21
5     9
dtype: int64

In [82]:
series10.sort_values(ascending = False) # soritng values in descending order

0    40
2    34
4    21
5     9
3     8
1     6
dtype: int64

In [84]:
series11.sort_index(ascending = False) # sorting index in descending order

5     9
4    21
3     8
2    34
1     6
0    40
dtype: int64

In [87]:
# let us use count and size function
series_nan

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [92]:
series_nan.count() #count all elemnts excluding missing values

4

In [93]:
series_nan.size # counting all ele including missing values

5

In [97]:
# let us find the index of maximum element in the series
series10

0    40
1     6
2    34
3     8
4    21
5     9
dtype: int64

In [98]:
series10.argmax() #index where largest element resides #idxmax

0

In [100]:
series2.argmax() #index where largest element resides

4

In [101]:
# extract the value using argmax
series10[series10.argmax()]

40

In [103]:
series2[series2.argmax()]

5

In [105]:
# argmin - to find the min ele in series
series10.argmin()

1

In [107]:
series2.argmin()

0

In [108]:
# extratt the element at that index
series10[series10.argmin()]

6

In [109]:
series2[series2.argmin()]

1

In [112]:
# sorting algorithms - quicksort
series10

0    40
1     6
2    34
3     8
4    21
5     9
dtype: int64

In [1]:
import pandas as pd
import numpy as np

In [114]:
series10.argsort() # return the index

0    1
1    3
2    5
3    4
4    2
5    0
dtype: int64

In [115]:
series10[series10.argsort()]

1     6
3     8
5     9
4    21
2    34
0    40
dtype: int64

In [116]:
series10

0    40
1     6
2    34
3     8
4    21
5     9
dtype: int64

In [118]:
series10.idxmax() # index of largest element

0

In [119]:
series10.idxmin() # index of smallest element

1

In [120]:
series5

a    5
b    6
c    7
d    8
e    9
dtype: int64

In [122]:
series5[series5.argmax()]

9

# DataFrame

In [123]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
# see the information about the above dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [127]:
# let us analyse age columns as it has missing values
df['Age'] #selecting age columns

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [128]:
# We want to count the mising values
df['Age'].isnull() # return boolean values

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [130]:
# count missing values
df['Age'].isnull().sum()

177

<font size ="3"> Total 177 missing values

In [138]:
# let us see missing values in whole dataframe
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [155]:
# let us create the dataframe
dict1 = {"ID":[1,2,3],"Name":["Parmeet","Trishaan","Anit"],"Age":[27,3,15]}
dict1

{'ID': [1, 2, 3], 'Name': ['Parmeet', 'Trishaan', 'Anit'], 'Age': [27, 3, 15]}

In [143]:
# converting dictionary to dataframe
pd.DataFrame(dict1)

   ID      Name  Age
0   1   Parmeet   27
1   2  Trishaan    3
2   3      Anit   15

In [156]:
# renaming index
df1 = pd.DataFrame(dict1, index=['a','b','c'])
df1

   ID      Name  Age
a   1   Parmeet   27
b   2  Trishaan    3
c   3      Anit   15

In [153]:
df1 = df1.set_index("ID") 
# df1.set_index("ID", inplace = True)

In [163]:
df1

        Name  Age
ID
1    Parmeet   27
2   Trishaan    3
3       Anit   15

In [166]:
df1.reset_index(inplace = True)

In [167]:
df1

   ID      Name  Age
0   1   Parmeet   27
1   2  Trishaan    3
2   3      Anit   15

In [148]:
#making col as index
pd.read_csv("train.csv",index_col="PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [170]:
# create another df
df2 = pd.DataFrame({"S_ID":[100,101,102,103,104,105,106],"Marks":[89,98,100,60,98,100,98]})
df2

   S_ID  Marks
0   100     89
1   101     98
2   102    100
3   103     60
4   104     98
5   105    100
6   106     98

In [173]:
#unique elements
df2['Marks'].unique()

array([ 89,  98, 100,  60], dtype=int64)

In [174]:
# count the unique elements
df2['Marks'].nunique()

4

In [175]:
# let us see the occurence of each unique elemnts
df2['Marks'].value_counts()

98     3
100    2
89     1
60     1
Name: Marks, dtype: int64

In [177]:
# let us extract the column names
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [180]:
# let us extract the index names
df1.set_index("ID",inplace=True)
df1

        Name  Age
ID
1    Parmeet   27
2   Trishaan    3
3       Anit   15

In [181]:
df1.index

Int64Index([1, 2, 3], dtype='int64', name='ID')

In [182]:
df1.reset_index(inplace = True)

In [185]:
df1.set_index("Name",inplace = True)
df1

          ID  Age
Name
Parmeet    1   27
Trishaan   2    3
Anit       3   15

In [186]:
df1.index

Index(['Parmeet', 'Trishaan', 'Anit'], dtype='object', name='Name')

In [188]:
df1.reset_index(inplace = True)

In [192]:
# conver the series to arrays
df1['Age'].values

array([27,  3, 15], dtype=int64)

In [193]:
# we want to rename the col from Marks to percentage
df2

   S_ID  Marks
0   100     89
1   101     98
2   102    100
3   103     60
4   104     98
5   105    100
6   106     98

In [194]:
df2.rename(columns={"Marks":"Percentage"}, inplace = True)
df2

   S_ID  Percentage
0   100          89
1   101          98
2   102         100
3   103          60
4   104          98
5   105         100
6   106          98

# Indexing in DataFrames

In [195]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [196]:
# filtering of cols - Name, Age and Survived
list1 = ["Name","Age","Survived"]
df[list1]  #df[["Name","Age","Survived"]]

                                                  Name   Age  Survived
0                              Braund, Mr. Owen Harris  22.0         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                             Allen, Mr. William Henry  35.0         0
..                                                 ...   ...       ...
886                              Montvila, Rev. Juozas  27.0         0
887                       Graham, Miss. Margaret Edith  19.0         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN         0
889                              Behr, Mr. Karl Howell  26.0         1
890                                Dooley, Mr. Patrick  32.0         0

[891 rows x 3 columns]

In [198]:
type(df[list1])

pandas.core.frame.DataFrame

In [200]:
# Note : if we are passing only one col it is series, how about converting series to df
type(df['Age'])

pandas.core.series.Series

In [203]:
list2 = ["Age"]
type(df[list2])

pandas.core.frame.DataFrame

In [204]:
# df['Age'] -> Series and df[['Age']] -> Dataframe

In [205]:
# filter the rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [207]:
# we want to select rows where PClass is 3
df['Pclass'] == 3 #boolean outputs

0       True
1      False
2       True
3      False
4       True
       ...
886    False
887    False
888     True
889    False
890     True
Name: Pclass, Length: 891, dtype: bool

In [209]:
condition = df['Pclass'] == 3
df[condition] # filetered the rows based on condition

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [212]:
# we want to select the rows where Pclass is 3 and the person embarked from port "S"
# df['Pclass'] ==3
df['Embarked'] =='S'

0       True
1      False
2       True
3       True
4       True
       ...
886     True
887     True
888     True
889    False
890    False
Name: Embarked, Length: 891, dtype: bool

In [216]:
# combine the various condition we will use boolean operators(&,|)
(df['Pclass'] ==3) & (df['Embarked'] == 'S')

0       True
1      False
2       True
3      False
4       True
       ...
886    False
887    False
888     True
889    False
890    False
Length: 891, dtype: bool

In [217]:
# filter the rows
condition = (df['Pclass'] ==3) & (df['Embarked'] == 'S')
df[condition]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [222]:
# let us combine filterinf rows and cols in  one go # dataframe.loc[rows,cols]
# I want to select all the rows where Pclass is 3 and Embarked is S andselect columns as "Name","Age","Survived","Pclass","Embarked"

col_condition = ["Name","Age","Survived","Pclass","Embarked"]
row_condition = (df['Pclass'] ==3) & (df['Embarked'] =="S")

df.loc[row_condition, col_condition]  #df.loc[(df['Pclass'] ==3) & (df['Embarked'] =="S"),["Name","Age","Survived","Pclass","Embarked"]]
#df[row_condition]
#df[col_condition]

,Name,Age,Survived,Pclass,Embarked
0,"Braund, Mr. Owen Harris",22.0,0,3,S
2,"Heikkinen, Miss. Laina",26.0,1,3,S
4,"Allen, Mr. William Henry",35.0,0,3,S
7,"Palsson, Master. Gosta Leonard",2.0,0,3,S
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",27.0,1,3,S
...,...,...,...,...,...
878,"Laleff, Mr. Kristo",NaN,0,3,S
881,"Markun, Mr. Johann",33.0,0,3,S
882,"Dahlberg, Miss. Gerda Ulrika",22.0,0,3,S
884,"Sutehall, Mr. Henry Jr",25.0,0,3,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,0,3,S

In [226]:
# how about if we want to select columns and rows on basis of index df.iloc[row,col]

#selecting 4th row
df.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [227]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [228]:
# check the number of rows and cols
df.shape

(891, 12)

In [230]:
df.shape[0] # rows

891

In [231]:
df.shape[1] #cols

12

In [235]:
# selecting all alternate rows and all alternate columns from df
row_index_condition = np.arange(0,df.shape[0],2)
col_index_condition = np.arange(0,df.shape[1],2)

df.iloc[row_index_condition,col_index_condition]

     PassengerId  Pclass     Sex  SibSp            Ticket Cabin
0              1       3    male      1         A/5 21171   NaN
2              3       3  female      0  STON/O2. 3101282   NaN
4              5       3    male      0            373450   NaN
6              7       1    male      0             17463   E46
8              9       3  female      0            347742   NaN
..           ...     ...     ...    ...               ...   ...
882          883       3  female      0              7552   NaN
884          885       3    male      0   SOTON/OQ 392076   NaN
886          887       2    male      0            211536   NaN
888          889       3  female      1        W./C. 6607   NaN
890          891       3    male      0            370376   NaN

[446 rows x 6 columns]

In [237]:
# series replace
series2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [238]:
# in series 2 I want to replace 5 by 10
series2.replace(5,10)

0     1
1     2
2     3
3     4
4    10
dtype: int64

In [242]:
df1['Age'].replace(27,25, inplace=True)
df1

       Name  ID  Age
0   Parmeet   1   25
1  Trishaan   2    3
2      Anit   3   15

# statistical information about df

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.describe() # by default it is on numerical cols

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
# categorical cols
df.describe(include="object")

                      Name   Sex Ticket    Cabin Embarked
count                  891   891    891      204      889
unique                 891     2    681      147        3
top     Dennis, Mr. Samuel  male   1601  B96 B98        S
freq                     1   577      7        4      644

In [14]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [19]:
df.loc[df['Ticket'] =='1601',"Ticket"].shape

(7,)

In [20]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [21]:
df.describe(percentiles=[.05,.25,.50,.75,.95,.99])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
5%,45.500000,0.000000,1.000000,4.000000,0.000000,0.000000,7.225000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
95%,846.500000,1.000000,3.000000,56.000000,3.000000,2.000000,112.079150
99%,882.100000,1.000000,3.000000,65.870000,5.000000,4.000000,249.006220
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
df.describe(exclude=int)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dennis, Mr. Samuel",male,NaN,NaN,NaN,1601,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [23]:
df.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Dennis, Mr. Samuel",male,NaN,NaN,NaN,1601,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

# Concatenation Operations

<font size="3">Inner join, outer joine, left join, right join, cross join

In [24]:
dict1 = {"ID":[1,2,3,4,5],"Name":['Parmeet','Eshwar','Chanda','Pavan','Hari']}
dict1

{'ID': [1, 2, 3, 4, 5],
 'Name': ['Parmeet', 'Eshwar', 'Chanda', 'Pavan', 'Hari']}

In [26]:
df1 = pd.DataFrame(dict1)
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [28]:
dict2 = {'S.No':[4,3,2,6],'Age':[24,23,22,21]}
dict2

{'S.No': [4, 3, 2, 6], 'Age': [24, 23, 22, 21]}

In [29]:
df2 = pd.DataFrame(dict2)
df2

   S.No  Age
0     4   24
1     3   23
2     2   22
3     6   21

In [31]:
dict3 = {'ID':[4,3,2,6],'Age':[24,23,22,21]}
df3 = pd.DataFrame(dict3)

In [30]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [35]:
df2

   S.No  Age
0     4   24
1     3   23
2     2   22
3     6   21

# Merging operations

In [36]:
pd.merge(df1,df2, left_on="ID",right_on='S.No')

   ID    Name  S.No  Age
0   2  Eshwar     2   22
1   3  Chanda     3   23
2   4   Pavan     4   24

In [38]:
print(df1.columns)
print(df3.columns)

Index(['ID', 'Name'], dtype='object')
Index(['ID', 'Age'], dtype='object')

In [40]:
pd.merge(df1,df3, on ="ID") #pd.merge(df1,df3)

   ID    Name  Age
0   2  Eshwar   22
1   3  Chanda   23
2   4   Pavan   24

In [42]:
df4 = df3.copy() #deep copy

In [44]:
#how to drop columns
df4.drop("ID",axis=1,inplace = True)
df4

   Age
0   24
1   23
2   22
3   21

In [46]:
type(df4)

pandas.core.frame.DataFrame

In [47]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [48]:
# joinging df1 and df4 on basis of indexes
pd.merge(df1,df4,left_index=True,right_index=True)

   ID     Name  Age
0   1  Parmeet   24
1   2   Eshwar   23
2   3   Chanda   22
3   4    Pavan   21

In [50]:
pd.merge(df1,df3, on="ID", how="inner") # inner join how ="inner" is by default

   ID    Name  Age
0   2  Eshwar   22
1   3  Chanda   23
2   4   Pavan   24

In [53]:
pd.merge(df1,df2,left_on ="ID",right_on ="S.No",how="left")

   ID     Name  S.No   Age
0   1  Parmeet   NaN   NaN
1   2   Eshwar   2.0  22.0
2   3   Chanda   3.0  23.0
3   4    Pavan   4.0  24.0
4   5     Hari   NaN   NaN

In [54]:
pd.merge(df1,df2,left_on ="ID",right_on ="S.No",how="right")

    ID    Name  S.No  Age
0  4.0   Pavan     4   24
1  3.0  Chanda     3   23
2  2.0  Eshwar     2   22
3  NaN     NaN     6   21

In [55]:
pd.merge(df1,df2,left_on ="ID",right_on ="S.No",how="outer")

    ID     Name  S.No   Age
0  1.0  Parmeet   NaN   NaN
1  2.0   Eshwar   2.0  22.0
2  3.0   Chanda   3.0  23.0
3  4.0    Pavan   4.0  24.0
4  5.0     Hari   NaN   NaN
5  NaN      NaN   6.0  21.0

In [57]:
pd.merge(df1,df2, how ="cross")

    ID     Name  S.No  Age
0    1  Parmeet     4   24
1    1  Parmeet     3   23
2    1  Parmeet     2   22
3    1  Parmeet     6   21
4    2   Eshwar     4   24
5    2   Eshwar     3   23
6    2   Eshwar     2   22
7    2   Eshwar     6   21
8    3   Chanda     4   24
9    3   Chanda     3   23
10   3   Chanda     2   22
11   3   Chanda     6   21
12   4    Pavan     4   24
13   4    Pavan     3   23
14   4    Pavan     2   22
15   4    Pavan     6   21
16   5     Hari     4   24
17   5     Hari     3   23
18   5     Hari     2   22
19   5     Hari     6   21

# concat

In [66]:
df5 = pd.DataFrame({'ID':[6,5,8,9,10],'Name':['Satyanand','Sarafaraz','Shubham','Shivangi','Pravesh']})

In [67]:
df5

   ID       Name
0   6  Satyanand
1   5  Sarafaraz
2   8    Shubham
3   9   Shivangi
4  10    Pravesh

In [68]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [69]:
pd.concat([df1,df5],axis =0)

   ID       Name
0   1    Parmeet
1   2     Eshwar
2   3     Chanda
3   4      Pavan
4   5       Hari
0   6  Satyanand
1   5  Sarafaraz
2   8    Shubham
3   9   Shivangi
4  10    Pravesh

In [70]:
pd.concat([df1,df5],axis =0, ignore_index=True)

   ID       Name
0   1    Parmeet
1   2     Eshwar
2   3     Chanda
3   4      Pavan
4   5       Hari
5   6  Satyanand
6   5  Sarafaraz
7   8    Shubham
8   9   Shivangi
9  10    Pravesh

In [71]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [72]:
df2

   S.No  Age
0     4   24
1     3   23
2     2   22
3     6   21

In [73]:
pd.concat([df1,df2],axis=1)

   ID     Name  S.No   Age
0   1  Parmeet   4.0  24.0
1   2   Eshwar   3.0  23.0
2   3   Chanda   2.0  22.0
3   4    Pavan   6.0  21.0
4   5     Hari   NaN   NaN

In [74]:
pd.concat([df1,df2],axis=1,join="inner")

   ID     Name  S.No  Age
0   1  Parmeet     4   24
1   2   Eshwar     3   23
2   3   Chanda     2   22
3   4    Pavan     6   21

Normalized age = (age - min(age))/(max(age) - min(age))

In [78]:
df3['Age'].min()

21

In [79]:
df3['Age'].max()

24

In [82]:
# add a new column
df3['Normailzed Age'] = (df3['Age'] - df3['Age'].min())/(df3['Age'].max() - df3['Age'].min())
df3

   ID  Age  Normailzed Age
0   4   24        1.000000
1   3   23        0.666667
2   2   22        0.333333
3   6   21        0.000000

In [83]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [84]:
pd.concat([df1,df3],axis=0)

   ID     Name   Age  Normailzed Age
0   1  Parmeet   NaN             NaN
1   2   Eshwar   NaN             NaN
2   3   Chanda   NaN             NaN
3   4    Pavan   NaN             NaN
4   5     Hari   NaN             NaN
0   4      NaN  24.0        1.000000
1   3      NaN  23.0        0.666667
2   2      NaN  22.0        0.333333
3   6      NaN  21.0        0.000000

In [85]:
pd.concat([df1,df3],axis=1)

   ID     Name   ID   Age  Normailzed Age
0   1  Parmeet  4.0  24.0        1.000000
1   2   Eshwar  3.0  23.0        0.666667
2   3   Chanda  2.0  22.0        0.333333
3   4    Pavan  6.0  21.0        0.000000
4   5     Hari  NaN   NaN             NaN

In [86]:
# append - > pd.concat(axis=0)
df1.append(df3)

   ID     Name   Age  Normailzed Age
0   1  Parmeet   NaN             NaN
1   2   Eshwar   NaN             NaN
2   3   Chanda   NaN             NaN
3   4    Pavan   NaN             NaN
4   5     Hari   NaN             NaN
0   4      NaN  24.0        1.000000
1   3      NaN  23.0        0.666667
2   2      NaN  22.0        0.333333
3   6      NaN  21.0        0.000000

In [87]:
df3.append(df1)

   ID   Age  Normailzed Age     Name
0   4  24.0        1.000000      NaN
1   3  23.0        0.666667      NaN
2   2  22.0        0.333333      NaN
3   6  21.0        0.000000      NaN
0   1   NaN             NaN  Parmeet
1   2   NaN             NaN   Eshwar
2   3   NaN             NaN   Chanda
3   4   NaN             NaN    Pavan
4   5   NaN             NaN     Hari

In [88]:
df3

   ID  Age  Normailzed Age
0   4   24        1.000000
1   3   23        0.666667
2   2   22        0.333333
3   6   21        0.000000

In [89]:
df1

   ID     Name
0   1  Parmeet
1   2   Eshwar
2   3   Chanda
3   4    Pavan
4   5     Hari

In [104]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [105]:
# sex map male-0 and female-1
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [107]:
#apply and replace the same col
df['Sex'] = df['Sex'].apply(lambda x: 0 if x=="male" else 1)

In [108]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [110]:
df['Sex'].dtype

dtype('int64')

In [111]:
# mapping embarked
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [115]:
# s->0, c->1 and Q->2 else nan

def custom_map(x):
    if x =="S":
        return 0
    elif x=="C":
        return 1
    elif x=="Q":
        return 2
    else:
        return -1

In [117]:
df['Embarked'] = df['Embarked'].apply(custom_map)

In [118]:
df["Embarked"].unique()

array([ 0,  1,  2, -1], dtype=int64)

In [119]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [129]:
df['NAME'] = df['Name'].str.split(',').values

In [131]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,NAME
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0,"[Braund, Mr. Owen Harris]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1,"[Cumings, Mrs. John Bradley (Florence Briggs ..."
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,"[Heikkinen, Miss. Laina]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0,"[Futrelle, Mrs. Jacques Heath (Lily May Peel)]"
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0,"[Allen, Mr. William Henry]"